# Напишите программу (файл arithmetic.py), которая предлагала бы пользователю решить пример 4 * 100 - 54. 
# Потом выводила бы на экран правильный ответ и ответ пользователя. 
# Подумайте, нужно ли здесь преобразовывать строку в число.
print("Решите пример: 4 * 100 - 54")
answer = input("Ответ: ")
print("Правильный ответ:", 4 * 100 - 54)
print("Ваш ответ:", answer)