# Напишите программу, которая считывает длины двух катетов в прямоугольном треугольнике и выводит его площадь. 
# Каждое число записано в отдельной строке.
cathet1 = int(input("Длина 1-го катета: " ))
cathet2 = int(input("Длина 2-го катета: " ))
print("Площадь:", cathet1 * cathet2 / 2)