# Напишите программу, которая считывает три числа и выводит их сумму. 
# Каждое число записано в отдельной строке.
number1 = int(input("Введите 1-е число: "))
number2 = int(input("Введите 2-е число: "))
number3 = int(input("Введите 3-е число: "))
print(number1 + number2 + number3)